# Pandas Introduction

In [1]:
import numpy as np
import pandas as pd

## Series object

In [2]:
series_obj = pd.Series([31,22,43,44,55])
series_obj

0    31
1    22
2    43
3    44
4    55
dtype: int64

In [3]:
series_obj[0]

31

In [4]:
series_obj = pd.Series([31,22,43,44,55], index = ['a', 'b', 'c', 'd', 'e'], name = "Column_1")
# OR obj.index = ['a', 'b', 'c', 'd', 'e']
#    series_obj.name = "Column_1"
series_obj

a    31
b    22
c    43
d    44
e    55
Name: Column_1, dtype: int64

In [5]:
series_obj['a']   # like a dictionary

31

In [6]:
series_obj*2

a     62
b     44
c     86
d     88
e    110
Name: Column_1, dtype: int64

In [7]:
over_35 = series_obj>35
over_35

a    False
b    False
c     True
d     True
e     True
Name: Column_1, dtype: bool

In [8]:
series_obj[over_35]

c    43
d    44
e    55
Name: Column_1, dtype: int64

## DataFrame object
### **Create a DataFrame using a dictionary**

In [9]:
# create a DataFrame using dictionary (of Series objects)
data = {"Name": ["Tim Miller", "Ann Carter", "Ellen Lee"], 
        "Gender": ["Male", "Female", "Female"],
        "Age": [32, 44, 21]}
df = pd.DataFrame(data)
# print(df)  #does not display as an HTML table
df

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21

In [10]:
df.head() # == df.head(5)

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21

In [11]:
df.tail()  # == df.tail(5)

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21

In [12]:
# Series object
df['Name']     # dictionary notation

0    Tim Miller
1    Ann Carter
2     Ellen Lee
Name: Name, dtype: object

In [13]:
df.Name     # attribute notation; Tab completion

0    Tim Miller
1    Ann Carter
2     Ellen Lee
Name: Name, dtype: object

In [14]:
# assignment by column
df["Birth Year"] = 1999
df["Birth Year"]

0    1999
1    1999
2    1999
Name: Birth Year, dtype: int64

In [15]:
# add a column
df["Married"] = ['Yes', 'Yes', 'No']     # must match the length/index of the DataFrame
df

         Name  Gender  Age  Birth Year Married
0  Tim Miller    Male   32        1999     Yes
1  Ann Carter  Female   44        1999     Yes
2   Ellen Lee  Female   21        1999      No

In [16]:
df["Married"] = 'Yes'
df

         Name  Gender  Age  Birth Year Married
0  Tim Miller    Male   32        1999     Yes
1  Ann Carter  Female   44        1999     Yes
2   Ellen Lee  Female   21        1999     Yes

### **Create a DataFrame using a numpy array**

In [17]:
# create a DataFrame using an array
data = pd.DataFrame(np.arange(16).reshape(4,4), columns = ['one', 'two', 'three', 'four'])
data

   one  two  three  four
0    0    1      2     3
1    4    5      6     7
2    8    9     10    11
3   12   13     14    15

In [ ]:
data.drop("three", axis = 1)   # OR  axis = 'columns'
                            # returns  new object, doesn't change original

In [ ]:
data     # unchanged

In [ ]:
data.drop('three', axis = 1, inplace = True) # if you want it to change the original object then drop 'inplace'
                                         # destroys any data that is dropped

In [ ]:
data     # changed

## Selection and Filtering
### Select Columns

In [ ]:
# create a new DataFrame
data = pd.DataFrame(np.arange(100).reshape(10,10), columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
data

In [ ]:
data['a']

In [ ]:
data[["a", "e", "j"]]    # providing a single value or a list selects columns

In [ ]:
# boolean selection
data[data["j"] > 40]

### Select rows

In [ ]:
data[:1]     # use slice syntax to select rows

In [ ]:
data[5:9]

### Selection with loc and iloc
Allows you to select a subset of the rows and columns

In [ ]:
data

In [ ]:
# loc implies the name/label of the row and column
data.loc[1:5,"b"]

In [ ]:

data.loc[:5, 'a':'e']     # consecutive (loc selection is inclusive)

In [ ]:
data.loc[:5, ['c', 'f', 'i']]     # not consecutive

In [ ]:
# iloc is for integer/index selection  (iloc selection is exclusive)
data.iloc[:5, 2:5]

In [ ]:
data.iloc[4]  # gives you a row, assumes all of the columns

In [ ]:
data.iloc[[5, 0, 3], [9, 5, 0]]    # returns them in the order listed

In [ ]:
df.columns   # returns the names of the columns within the DataFrame

### Descriptive and summary statistics

In [ ]:
# import the iris data
iris_data = pd.read_csv("iris.csv", names = ["sepal_l", "sepal_w", "petal_l", "petal_w", "class"])

In [ ]:
iris_data.head()  # head() returns the first 5 columns by default; tail() returns the botom 5

In [ ]:
iris_data.describe()

In [ ]:
iris_data.columns

In [ ]:
iris_data["class"]

In [ ]:
set(iris_data["class"])

In [ ]:
iris_data["class"].describe()      # non-numerical data

In [ ]:
# some Descriptive and Summary statistics  (min, max, idxmin, idxmax, mean, median, std, count, corr)
iris_data.min()

In [ ]:
iris_data["sepal_l"].head(20)

In [ ]:
# .count() will return the number of items in an object
iris_data.loc[iris_data['sepal_l'] > 4.9, "sepal_l"].count()

In [ ]:
# you can also use the built-in python function len() to return the length of an object
len(iris_data[iris_data['sepal_l'] > 4.9])

In [ ]:
# use unique to get the number of unique items within a Series/column.
iris_data["class"].unique()

In [ ]:
# use value_counts() to get the quantity of each unique item within a Series/column.
iris_data["class"].value_counts()

### Transforming and Cleaning Data

In [ ]:
# create a new DataFrame
data = pd.DataFrame({'age': [0, 26, 41, 0], 'gender': ["Male", "Female", "Female", "Female"]})
data

In [ ]:
# Transform categorical variables into binary (discreet) variables
# map enables convenient element-wise transformations

data['gender'] = data['gender'].map({'Male': 0, 'Female': 1})
data

In [ ]:
data['gender'].sum()

In [ ]:
data.mean(axis=0)

In [ ]:
# replace values 
# nan ("not a number") values are not used in calculating the mean, etc.
 
data['age'] = data['age'].replace(0, np.nan)
data

# replace provides flexibility
# can also pass a list of multiple values to replace (e.g., replace([0, -1], np.nan)
# can provide a different replacement for each value (e.g., replace([0, -1], [np.nan, 1])

In [ ]:
data.mean()  # axis = 0 is the default

In [ ]:
# print formatting
# the number preceding the colon is the index position (0 is the default) within the format() tuple 
        # of the string that you want printed.
# following the colon is the formatting instructions: 
        # how many places following the decimal should be printed for the float.
    
print("The mean age is: {0:.1f}".format(data["age"].mean(), 99))

### Null (NaN) values

In [ ]:
# nan can be used as a sentinel to drop or impute/replace a value

data['age'].isnull()    # notnull()

In [ ]:
mask = data['age'].notnull() 
mask

In [ ]:
data.loc[mask, 'age']

### Impute missing values

In [ ]:
data.loc[data['age'].isnull(),'age'] = data['age'].mean()
data

### Boolean Selection

In [ ]:
iris_data.shape

In [ ]:
iris_data[iris_data['sepal_w'] < 3]

In [ ]:
# isin() is a boolean check to see if items within a columns are included in a list
iris_data["class"].isin(['Iris-setosa'])

In [ ]:
# include only the items that are included within a given list of items
mask = iris_data["class"].isin(['Iris-setosa', 'Iris-virginica'])
iris_data[mask]

## Boolean selection within pandas

In [18]:
# And
iris_data.loc[(iris_data['sepal_w'] < 3) & (iris_data['sepal_l'] > 5)].head()

NameError: name 'iris_data' is not defined

In [ ]:
# Following the selection of rows, list the columns to show.

iris_data.loc[(iris_data['sepal_w'] < 3) & (iris_data['sepal_l'] > 5), ['sepal_w','class']].head() # [:5]

In [ ]:
# Or
iris_data.loc[(iris_data['sepal_w'] < 2.5) | (iris_data['sepal_w'] > 3.5)]

In [ ]:
# Following the selection of rows, list the series of columns to show (inclusive).

iris_data.loc[(iris_data['sepal_w'] < 2.5) | (iris_data['sepal_w'] > 3.5), 'sepal_l':'petal_w']

In [ ]:
# return only the values, not the DataFrame
   # capital X usually indicates all of the features that the algorithm will be given to learn from

X = iris_data.loc[(iris_data['sepal_w'] < 2.5) | (iris_data['sepal_w'] > 3.5), 'sepal_l':'petal_w'].values
X

In [ ]:
# to return just the unique values use set() or .unique()

set(iris_data['class'])

In [ ]:
iris_data['class'].unique()

In [ ]:
# lowercase y usually indicates the classifications that you would like to predict.
    # Most algorithms require strings to be converted to numbers (you can use .map() to accomplish this).


y = iris_data['class'].map({'Iris-setosa':0, 'Iris-versicolor':1, 'Iris-virginica':2})
y

## Archive cleaned and transformed DataFrame

In [ ]:
# to save your cleaned data to file
df.to_csv("new_filename.csv")